In [5]:
import pandas as pd
import numpy as np

In [12]:
series = pd.Series(["하나", "둘", "셋", "넷", "다섯",
                   "여섯", "일곱", "여덟", "아홉", "열"],
                  index = range(1,11))

series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [30]:
# 콤마 대신 언더바를 사용할 수 있다.

s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
             index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [32]:
a = pd.Series([10, 20, 30, 40, 50, 60, 70, 80, 90],
             index = range(1,10))

a

1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [33]:
# idex를 지정하지 않고 Series를 만들면 인덱스는 0부터 시작되는 정수 값이 된다. 
b = pd.Series(list(range(10, 100, 10)))
b

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [34]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [35]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [36]:
series.index

RangeIndex(start=1, stop=11, step=1)

In [40]:
series.values

array(['하나', '둘', '셋', '넷', '다섯', '여섯', '일곱', '여덟', '아홉', '열'],
      dtype=object)

In [41]:
type(s.values)

numpy.ndarray

In [42]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [43]:
a = pd.Series([10, 20, 30, 40, 50, 60, 70, 80, 90],
             index = range(1,10))

a

1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [58]:
count=0


while True:
    i=1
    for i in range (1, 10):
        if a[i]>50:
            count += 1
    break
print(count)

4

In [60]:
sum(a.values > 50)

4

In [61]:
a.values > 50

array([False, False, False, False, False,  True,  True,  True,  True])

In [63]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [75]:
# 딕셔너리 형태로 만들어도 가능가능~~

d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [76]:
# 여기에 인덱스를 해서 순서를 맞춰줄 수도 있다.
# 순서를 만들어줌
# 딕셔너리는 비시퀀스여서 순서가 없다.    

d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['c', 'b', 'a'])
ser

c    3
b    2
a    1
dtype: int64

In [82]:
# 라벨 값이 공백 없는 문자열인 경우에는 index label이 속성인 것처럼 마침표를 활용해 인덱스에 접근할 수도 있다.
ser.a, ser.b, ser.c

(1, 2, 3)

In [83]:
c = pd.Series([88, 95, 100, 67],
             index = ["철수", "영희", "길동", "몽룡"])

c.index.name = "이름"
c.name = "사회 점수"

c

이름
철수     88
영희     95
길동    100
몽룡     67
Name: 사회 점수, dtype: int64

In [84]:
"서울" in s # 인덱스 레이블 중에 서울이 있는지 확인

True

In [85]:
"대전" in s

False

In [87]:
# key, values 호출
for k, v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [89]:
test = dict(zip(range(10), list("일이삼사오육칠팔구")))
test

{0: '일', 1: '이', 2: '삼', 3: '사', 4: '오', 5: '육', 6: '칠', 7: '팔', 8: '구'}

In [92]:
# dict
test.values()

dict_values(['일', '이', '삼', '사', '오', '육', '칠', '팔', '구'])

In [93]:
for k, v in test.items():
    print(f'{k}, {v}')

0, 일
1, 이
2, 삼
3, 사
4, 오
5, 육
6, 칠
7, 팔
8, 구

In [96]:
"일" in test.values()

True

In [97]:
9904312 in s.values

True

In [ ]:
count=0


while True:
    i=1
    for i in range (1, 10):
        if a[i]>50:
            count += 1
    break
print(count)

In [122]:
for k, v in s.items():
    if v > 3000000:
        print(f'{k}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [123]:
# 시리즈는 인덱스 라벨을 이용한 인덱싱도 할 수 있다.
# 배열 인덱싱이나 index label을 이용한 슬라이싱도 가능하다.

s[1], s["부산"]

(3448737, 3448737)

In [124]:
s[3], s["대구"]

(2466052, 2466052)

In [125]:
# 배열 인덱싱

s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [126]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [127]:
# 단 하나의 값이더라도 이렇게 시리즈 형태로도 값을 받아올 수 있다.
s[[0]]

도시
서울    9904312
Name: 인구, dtype: int64

In [130]:
s[[2]]

도시
인천    2890451
Name: 인구, dtype: int64

In [131]:
s[["인천"]]

도시
인천    2890451
Name: 인구, dtype: int64

In [134]:
# 슬라이싱으로 호출하는 방식
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [136]:
# 부산에서 대구까지. 
# 마지막 것까지 포함한다! 문자열만

s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [137]:
s2 = pd.Series({"서울":9631482, "부산":3393191, "인천":2632035, "대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [138]:
np.nan -20

nan

In [142]:
# 인구 증감을 알아보자
# 대전 대구는 s, s2 양쪽에 모두 존재하는 값이 아니어서 NaN 값이 나오게 된다.
# 순서는 NaN값이 먼저 나오고, 그 다음 가나다 순으로 나온다. 

ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [145]:
# NaN이면 True, NaN이 아니면 False 값
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [146]:
# NaN이 아니면 True, NaN이면 False 값
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [147]:
# NaN값을 삭제한다.
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [148]:
ds > 3000000

대구    False
대전    False
부산    False
서울    False
인천    False
dtype: bool

In [149]:
s # 2015년 도시별 인구

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [150]:
s2 # 2010년 도시별 인구

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [151]:
rs = (s-s2)/s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [159]:
rd = s-s2
rd = rd[rd.notnull()]

rd.sort_values(ascending=False)

서울    272830.0
인천    258416.0
부산     55546.0
dtype: float64

In [163]:
# 제일 큰 값의 인덱스를 반환한다.
ra=rd.argmax()
rd[ra]

272830.0

In [173]:
rd[rd.argmax()]

272830.0

In [164]:
rd[[rd.values.argmax()]]

서울    272830.0
dtype: float64

In [172]:
rd[ rd==rd.max() ]

서울    272830.0
dtype: float64

In [165]:
# 데이터의 수정 및 갱신
# 기존 인덱스에 값을 할당하면 된다.
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [166]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [167]:
rs["서울"] = 2.83
rs["인천"] = 9.82
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [170]:
# 슬라이싱된 개수와 바꿀 값의 개수가 같아야 한다.
rs["서울": "인천"] = (2.83, 9.82)
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [200]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자": 90000} 
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser1 = pd.Series(fin1)
ser1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [193]:
ser2 = pd.Series(fin2_value, fin2_index)
ser2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [183]:
# 네이버와 LG전자는 양쪽 딕셔너리에 모두 있는 게 아니어서 NaN이 뜬다.

ser1 - ser2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [184]:
ser1 + ser2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [185]:
ser1 * ser2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [186]:
ser1 / ser2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [187]:
type(ser1)

pandas.core.series.Series

In [195]:
result = ser1-ser2

result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [197]:
type(np.nan)

float

In [198]:
d = {'coll':[1,2], 'col2':[3,4]}

df = pd.DataFrame(data=d)
df

   coll  col2
0     1     3
1     2     4

In [274]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [275]:
df.dtypes

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [276]:
type(df.dtypes)

pandas.core.series.Series

In [277]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [278]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [279]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [280]:
df.index.name = "도시"

In [281]:
df.columns.name = "특성"

In [282]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [283]:
# 데이터 수정 및 업데이트

df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [284]:
# 컬럼은 시리즈였구나
type(df["2010-2015 증가율"])

pandas.core.series.Series

In [285]:
# 2005-2010 증가율이라는 이름의 컬럼 추가

df["2005-2015 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [286]:
# 삭제

del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [287]:
# 하나의 컬럼만 인덱싱하면 시리즈가 반환된다. 

df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [288]:
# 인덱스로 label값을 하나의 컬럼만 넣으면 시리즈 객체가 반환된다.
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [289]:
type(df["2010"])

pandas.core.series.Series

In [290]:
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [292]:
# 하나의 컬럼만 쓰지만 dataframe자료형은 유지하고 싶을때
# 요소가 하나인 리스트 자료형을 사용해 인덱싱하면 된다.
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [293]:
type(df[["2010"]])

pandas.core.frame.DataFrame

##### DataFrame의 컬럼 인덱스가 문자열 라벨일때는 순서를 나타내는 정수 인덱스를 컬럼 인덱싱에 사용할 수 없다.
df["0"]

In [297]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [298]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [299]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [300]:
# row 단위로 인덱싱을 하고자 하면 항상 슬라이싱을 해야 한다.
# 인덱스의 값이 문자 label이면 label 슬라이싱도 가능하다.
df

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [302]:
# df[:"서울"]       --> 문자는 범위 포함, 숫자는 미포함
df[:1]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [303]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [306]:
# 부산 row만 보고 싶을 때는 이렇게 슬라이싱.
# 한줄인 row 열람하는 법.

df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [305]:
# row 단위로 그냥 
# df["서울"]이렇게 하면 KeyError가 발생된다.

In [307]:
# DataFrame에서 컬ㄹ머 라벨로 인덱싱하면 시리즈가 된다.
# 이 시리즈를 다시 row label로 인덱싱하면 개별 데이터가 나온다.

df["2015"]["서울"]

9904312

In [308]:
type(df["2015"]["서울"])

numpy.int64

In [310]:
data = {"국어": [80, 90, 70, 30], "영어": [90, 70, 60, 40], "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [311]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [313]:
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [344]:
df["평균"] = round((df["국어"] + df["영어"] + df["수학"]) /3, 2)

df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67
평균   0   0   0   0.00

In [319]:
df[:"춘향"]

    국어  영어  수학
춘향  80  90  90

In [367]:
df.T["향단"]

국어       70.0
영어       60.0
수학       80.0
평균       70.0
평균 점수    70.0
평균점수3    70.0
Name: 향단, dtype: float64

In [368]:
df.loc["향단"]

국어       70.0
영어       60.0
수학       80.0
평균       70.0
평균 점수    70.0
평균점수3    70.0
Name: 향단, dtype: float64

In [369]:
#(3)모든 학생의 과목 평균 점수를 새로운 열로
df['평균 점수']=df.mean(axis=1).round(2)
df

    국어  영어  수학     평균  평균 점수  평균점수3
춘향  80  90  90  86.67  86.67  86.67
몽룡  90  70  60  73.33  73.33  73.33
향단  70  60  80  70.00  70.00  70.00
방자  30  40  70  46.67  46.67  46.67
평균   0   0   0   0.00   0.00   0.00

In [370]:
df["평균점수3"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
df

    국어  영어  수학     평균  평균 점수  평균점수3
춘향  80  90  90  86.67  86.67  86.67
몽룡  90  70  60  73.33  73.33  73.33
향단  70  60  80  70.00  70.00  70.00
방자  30  40  70  46.67  46.67  46.67
평균   0   0   0   0.00   0.00   0.00

In [374]:
# np.random.randn()  --> 평균 0, 표준편차 1의 가우시안 표준 정규분포 난수를
# matrix array(m,n)으로 생성
np.random.seed(0)

data1 = pd.date_range('20130206', periods = (6))
                      
df_a = pd.DataFrame(np.random.randn(6,4), index = data1, columns = list("ABCD"))
df_a

                   A         B         C         D
2013-02-06  1.764052  0.400157  0.978738  2.240893
2013-02-07  1.867558 -0.977278  0.950088 -0.151357
2013-02-08 -0.103219  0.410599  0.144044  1.454274
2013-02-09  0.761038  0.121675  0.443863  0.333674
2013-02-10  1.494079 -0.205158  0.313068 -0.854096
2013-02-11 -2.552990  0.653619  0.864436 -0.742165

In [236]:
titanic_df = pd.read_csv("/Users/ye/23_Data analysis/csv/titanic.csv")

titanic_df

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [232]:
titanic_df.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [230]:
JEOPARDY_df = pd.read_csv("/Users/ye/23_Data analysis/csv/JEOPARDY_CSV.csv")

JEOPARDY_df

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams
...,...,...,...,...,...,...,...
216925,4999,2006-05-11,Double Jeopardy!,RIDDLE ME THIS,$2000,This Puccini opera turns on the solution to 3 ...,Turandot
216926,4999,2006-05-11,Double Jeopardy!,"""T"" BIRDS",$2000,In North America this term is properly applied...,a titmouse
216927,4999,2006-05-11,Double Jeopardy!,AUTHORS IN THEIR YOUTH,$2000,"In Penny Lane, where this ""Hellraiser"" grew up...",Clive Barker
216928,4999,2006-05-11,Double Jeopardy!,QUOTATIONS,$2000,"From Ft. Sill, Okla. he made the plea, Arizona...",Geronimo
216929,4999,2006-05-11,Final Jeopardy!,HISTORIC NAMES,None,A silent movie title includes the last name of...,Grigori Alexandrovich Potemkin